<?php

//多语言只支持两种
$SYSTERM_COMMON_LANGUAGE = array(
		"message"	=> array(
			'china'	=>  array(
			    "title" => array(
			            11  => "用户 %s 刚刚通过您分享的链接加入了葡萄分享，奖励您 %s 葡萄，继续邀请可以赚更多葡萄哦~",
						13  => "您的订单尚未完成支付，将于15分钟后失效，并扣除%d葡萄，赶快去支付吧~",
						14  => "您的订单已支付完成，该宝贝将在%s天后从%s发出，请耐心等待哦~",
						15  => "您的订单已发货，感谢您的耐心等待。请注意，确认收货前请认真检查宝贝是否缺失或损坏哦~",
                        16  => "您的订单已签收，租用周期为%s个月，从明天起计算，如需续期请在%s之前完成哦，最长可以租用6个月。",
			            17  => "您的订单已续期%s个月，总租用周期为%s个月，如需续期请在%s之前完成哦，最长可以租用6个月。",
			            18  => "您的订单即将完成租用，请您提前准备好宝贝，清洗并打包，我们将安排快递上门取货，请留意接听电话。",
			            19  => "您的订单已寄出，待传递用户确认收货后，账户内冻结的%s葡萄将会解冻，请耐心等待哦。",
			            20  => "您的订单已完成租用，账户中的%s葡萄已解冻，感谢您的传递，再来挑一些喜欢的礼物吧。",

                        30  => "您分享的宝贝已经通过审核%s，%s 葡萄已发放至您的账户，有用户下单后，我们将安排快递上门取货，请您留意接听电话。葡萄当前处于冻结状态，待用户确认收货后将会解冻，请您耐心等待哦。",

                        31  => "您分享的宝贝已寄出，待用户确认收货后 %s 葡萄将会解冻，请您耐心等待哦。",
                        32  => "您分享的宝贝已经被用户确认收货啦，账户中的 %s 葡萄已解冻，感谢您的分享，快来看看这些葡萄能换些什么礼物吧。",
                        
                        33  => "恭喜您的葡萄彩票中了%s，%s葡萄已发放至您的账户，请注意查收。",
			    		
			    		
			    		34	=> "%s参加了您邀请的组团分享活动“%s”，还差%s人就组团成功了，赶快继续邀请吧！",
			    		35	=> "您参加了%s邀请的组团分享活动“%s”，还差%s人就组团成功了，赶快继续邀请吧！",
			    		36	=> "%s参加了您邀请的组团分享活动“%s”，组团成功，参与序列号%s，预祝您中大奖",
			    		37	=> "您参加了%s邀请的组团分享活动“%s”，组团成功，参与序列号%s，预祝您中大奖！",
			    		38	=> "恭喜您在组团分享活动“%s”中获得奖品%s，稍后会有工作人员与您联系奖品发放事宜，请留意接听电话。",
			    		
			    		
			    		39  => "您分享的宝贝线上审核未通过，原因：%s，请您修改后重新提交，感谢您的分享。",
			        
			        
			            40 => "您参与的%s夺宝成功，请您在24小时内支付运费和服务费，超时未支付视为流拍，订单将自动取消，商品会重新上架销售。",
),
				"content" => array(

				),
				"value" => array(

				),
			),
//			'abroad'=> array(
//			    "title" => array(
//    			        13  => "您的订单尚未完成支付，将于15分钟后失效，并扣除%d葡萄，赶快去支付吧~",
//    			        14  => "您的订单已支付完成，该宝贝将在3天后由%s从%s发出，请耐心等待哦~",
//    			        15  => "您的订单已发货，感谢您的耐心等待。请注意，确认收货前请认真检查宝贝是否缺失或损坏哦~",
//    			        16  => "您的订单已签收，租用周期为%s个月，从明天起计算，如需续期请在%s之前完成哦，最长可以租用6个月。",
//    			        17  => "您的订单已续期%s个月，总租用周期为%s个月，如需续期请在%s之前完成哦，最长可以租用6个月。",
//    			        18  => "您的订单即将完成租用，请您提前准备好宝贝，清洗并打包，我们将安排快递上门取货，请留意接听电话。",
//    			        19  => "您的订单已寄出，待传递用户确认收货后，账户内冻结的%s葡萄将会解冻，请耐心等待哦。",
//    			        20  => "您的订单已完成租用，账户中的%s葡萄已解冻，感谢您的传递，再来挑一些喜欢的礼物吧。",
//			    ),
//				"content" => array(
//
//				),
//				"value"	=> array(
//
//				),
//			),
		),

        'wx_program_template_msg' => [
            110  => [
                'remark' => '您的订单尚未完成支付，15分钟后订单将失效，并扣除%s颗葡萄，赶快去支付吧~'
            ],
        	120  => [
        		'remark' => '%s葡萄已退款，取消订单扣除%s葡萄。'
        	],
        	130  => [
        		'remark' => '您的订单已签收，感谢您对葡萄分享的支持，祝您购物愉快。'
        	],
            16  => [
                'remark' => '稍后快递小哥将会联系您免费上门取件，请您提前准备好闲置宝贝并留意接听电话，感谢您的善举。'
            ],
            15  => [
                'remark' => '您的订单正在审核中，审核通过后将有快递小哥联系您免费上门取件，请您提前准备好闲置宝贝并留意接听电话。'
            ],
            14  => [
                'remark' => '您的订单已续期%s个月，总租用周期为%s个月，如需续期请在%s之前完成哦，最长可以租用6个月。'
            ],
            13  => [
                'remark' => '您的订单已签收，租用周期为%s个月，从明天起计算，如需续期请在%s之前完成哦，最长可以租用6个月。'
            ],
            12  => [
                'remark' => '押金%s葡萄已解冻，取消订单扣除%s葡萄。'
            ],
            11  => [
                'remark' => '您的订单尚未完成支付，15分钟后订单将失效，并扣除%s颗葡萄，赶快去支付吧~'
            ],
            10  => [
                'remark' => '您的订单已支付完成，该商品将在%s天后从%s发出，请耐心等待哦~'
            ],
        ],

);