<?php

namespace application\common\libs\tools;

use application\common\models\area\AreaModel;
use application\common\libs\common\RoomListingCache;
use application\common\models\room\models\location\rpc\RpcLocation;
class SubwaySort
{
    /**
     * 地铁有序列表
     * @return array
     */
    public static function list()
    {
        return [
            'bj' => ['1号线', '2号线', '3号线', '4号线', '5号线', '6号线', '6号线在建', '7号线', '8号线', '9号线', '10号线', '11号线', '12号线', '13号线', '14号线', '14号线东段', '15号线', '16号线', '17号线', '18号线', '19号线', '19号线（支线）', '20号线', '21号线', '22号线', '29号线', '30号线', '31号线',  'D1号线', 'L6线', 'S1线', '亦庄线',  '八通线', '大兴线', '平谷线', '房山线', '新机场线', '昌平线', '机场线', '永乐线', '燕房线', '玉屏线路', '西郊线', '燕郊S6线'],// '昌平线南延',
            'sz' => ['1号罗宝线', '2号蛇口线', '3号龙岗线', '4号龙华线', '5号线', '5号环中线','6号线', '7号线', '8号线', '9号线', '10号线', '11号线', '12号线', '13号线', '14号线', '16号线', '20号线'],
            'sh' => ['1号线', '2号线', '3号线', '4号线', '5号线', '5号线南延伸线（在建）', '6号线', '7号线', '8号线', '9号线', '10号线', '11号线', '12号线', '13号线', '13号线在建', '14号线', '14号线在建', '15号线', '15号线在建', '16号线', '17号线', '18号线',  '18号线（在建）', '浦江线'],
            'hz' => ['1号线', '2号线', '4号线', '5号线', '6号线', '7号线', '8号线', '富阳线'],
            'tj' => ['1号线', '2号线', '2号线', '3号线', '4号线', '5号线', '6号线', '7号线', '7号线在建', '9号线','10号线','B1号线', 'Z4号线'],
            'wh' => ['1号线', '2号线', '3号线', '4号线', '5号线', '6号线', '7号线', '8号线', '11号线', '12号线', '21号线', '27号线', '阳逻线', '纸坊线'],
            'nj' => ['1号线', '2号线', '3号线', '4号线', '5号线', '6号线', '7号线', '8号线', '9号线', '10号线', '11号线',  '13号线', '15号线', 'S1号线', 'S3号线', 'S7号线','S8号线','S9号线'],
            'gz' => ['1号线', '2号线', '3号线', '3号线(北延段)', '4号线', '5号线', '6号线', '7号线', '8号线', '9号线', '11号线', '12号线', '13号线', '14号线', '18号线', '21号线', '22号线', 'APM', '佛山2号线', '佛山3号线', '广佛线'],//, '知识城线'
            'cd' => ['1号线', '2号线', '3号线', '4号线', '5号线', '6号线', '7号线', '8号线', '9号线', '10号线', '11号线', '17号线', '18号线'],
        ];
    }

    /**
     * 地铁有序列表
     * @return array
     */
    public static function effectiveList()
    {
        return [
            'bj' => ['1号线', '2号线', '3号线', '4号线', '5号线', '6号线', '7号线', '8号线', '9号线', '10号线', '12号线', '13号线', '14号线', '14号线东段', '14号线西段', '15号线', '16号线', '17号线', '19号线', '19号线（支线）', 'L6线', 'S1线', '亦庄线',  '八通线', '大兴线', '平谷线', '房山线', '新机场线', '昌平线', '机场线', '燕房线', '西郊线'],// '昌平线南延',
            'sz' => ['1号罗宝线', '2号蛇口线', '3号龙岗线', '4号龙华线', '5号环中线', '7号线', '9号线', '10号线', '11号线', '12号线'],
            'sh' => ['1号线', '2号线', '3号线', '4号线', '5号线', '6号线', '7号线', '8号线', '9号线', '10号线', '11号线', '12号线', '13号线', '14号线', '15号线', '16号线', '17号线', '18号线', '浦江线'],
            'hz' => ['1号线', '2号线', '4号线', '5号线', '6号线', '7号线', '8号线'],
            'tj' => ['1号线', '2号线', '2号线', '3号线', '4号线', '5号线', '6号线', '7号线', '9号线','10号线','B1号线', 'Z4号线'],
            'wh' => ['1号线', '2号线', '3号线', '4号线', '5号线', '6号线', '7号线', '8号线', '11号线', '12号线', '阳逻线', '纸坊线'],
            'nj' => ['1号线', '2号线', '3号线', '4号线', '5号线', '6号线', '7号线', '8号线', '9号线', '10 号线', '11号线',  '13号线', '15号线', 'S1号线', 'S3号线', 'S7号线','S8号线','S9号线'],
            'gz' => ['1号线', '2号线', '3号线', '3号线(北延段)', '4号线', '5号线', '6号线', '7号线', '8号线', '9号线', '11号线', '12号线', '13号线', '14号线', '18号线', '21号线', '22号线', 'APM', '佛山2号线', '佛山3号线', '广佛线', '知识城线'],//
            'cd' => ['1号线', '2号线', '3号线', '4号线', '5号线', '6号线', '7号线', '8号线', '9号线', '10号线', '11号线', '17号线', '18号线'],
        ];
    }

    //排序地铁数据
    public static function initData()
    {
        $subwayListSort = self::effectiveList();
        $arrayReturn = [];
        foreach (AreaModel::list() as $cityCode => $city) {
            $cache = new RoomListingCache($cityCode);
            //$subwayList = RpcLocation::RPCfindEffectiveCityLines($city);
            $subwayList = $subwayListSort[$cityCode];
            if ($cityCode == 'bjqq') {
                print_r($subwayList);
                //print_r($subwayList1);
                $array1 = RpcLocation::RPCfindEffectiveSubwaysByCityLine($city, '19号线');
                var_dump($city);
                $lines1 = collect($array1)->pluck('name')->toArray();
                print_r($lines1);
                exit;
            }
            $subway = [];

            foreach ($subwayList as $item) {

                //$array = RpcLocation::RPCfindSubwaysByCityLine($city, $item);
                //$lines = collect($array)->pluck('name')->toArray();
                $array1 = RpcLocation::RPCfindEffectiveSubwaysByCityLine($city, $item);
                $lines1 = collect($array1)->pluck('name')->toArray();

                $subway[$item] = $lines1;
            }

            $cache->setSubway($subway);
            $arrayReturn[] = $cityCode;
        }

        return $arrayReturn;
    }
}