<?php
class Policy
{
    private $_options  = array();
    private $_type     = "";
    
    private static $keywords  = array(
    0 => '同城可约',
    1 => '真人看逼',
    2 => '看美女脱',
    3 => '开车软件',
    4 => '万猩钻卫信',
    5 => '全裸',
    6 => '性感全拖',
    7 => '裸体直播',
    8 => '看~美~女~逼',
    9 => '看逼',
    10 => '看美女跳',
    11 => '万星钻',
    12 => '黄色直播间的',
    13 => '主.啵.騒.脱.摸.乃',
    14 => '葳鑫',
    15 => '开车表演',
    16 => '脱咣粿身',
    17 => '+薇',
    18 => '私博粿廖加威',
    19 => '马上开车',
    20 => '做爱',
    21 => '看䒚妋侳愛',
    22 => '三千星钻私我',
    23 => '看性感全拖',
    24 => '买10万砖石',
    25 => '註潘',
    26 => '裸秀',
    27 => '洎卫',
    28 => '自慰视频',
    29 => '看逼看奶',
    30 => '夜映直播',
    31 => '周结的直播平台',
    32 => '礼物提成',
    33 => '佺光虂咪',
    34 => '想看BB的哥哥',
    35 => '我是经纪公司的运营',
    36 => '映客号',
    37 => '加妹妹微信',
    38 => '私播',
    39 => '不发工资',
    40 => '提成高',
    41 => '换个平台',
    42 => '没有任务',
    43 => '有意愿换个大的平台',
    44 => '我是花椒',
    45 => '收益高',
    46 => '无时长',
    47 => '漏穴',
    48 => '换平台',
    49 => '有兴趣来',
    50 => '平台流量大',
    51 => '保底',
    52 => '主箥',
    53 => '骚脱',
    54 => '躶舞',
    55 => '看逼看奶',
    56 => '有兴趣的加',
    57 => '换一个平台',
    58 => '好的方面发展',
    59 => '更好的发展',
    60 => '有兴趣加我',
    61 => '周结',
    62 => '月结',
    63 => '我是直播运营',
    64 => '谈谈合作',
    65 => '视频聊',
    66 => '一対一',
    67 => '看表演',
    68 => '看比',
    69 => '瘙鮵',
    70 => '美.女.啊',
    71 => '要.不.要',
    72 => '来.我.平',
    73 => '试.试.呐',
    74 => '广招主播',
    75 => '感兴趣的话',
    76 => '日结',
    77 => '看少女自摸',
    78 => '有没有兴趣',
    79 => '来花椒',
    80 => '加v信',
    81 => '花椒直播',
    82 => '高提成',
    83 => '黄播软件',
    84 => '石榴直播',
    85 => '主播绝活',
    86 => '下载',
    87 => '粉桃',
    88 => '大尺度',
    89 => '哥哥加我',
    90 => '一个平台',
    91 => '黄播',
    92 => '诱 惑',
    93 => '诱惑',
    94 => '感谢大家支持',
    95 => '有兴趣私我',
    96 => '看巨乳',
    97 => '辣鸡平台',
    98 => '还我血汗钱',
    99 => '学生妹',
    100 => '同城',
    101 => '少妇',
    102 => '喷水',
    103 => '约少妇',
    104 => '别的平台',
    105 => '看丰满',
    106 => '正规公司',
    107 => '正规平台',
    108 => '克扣主播工资',
    109 => '加V',
    110 => '个平台',
    111 => '激情热舞',
    112 => '不封顶',
    113 => '感谢大家关注',
    114 => '咣粿',
    115 => '考虑一下',
    116 => '自慰视频',
    117 => '皇色直播',
    118 => '阴穴',
    119 => '过寂寞',
    120 => '搔儛',
    121 => '全脱',
    122 => '打个广告',
    123 => '马上开播',
    124 => '镁女V信',
    125 => '螺身',
    126 => '插比',
    127 => '倮聊',
    128 => '指挥互动',
    129 => '工资日结',
    130 => '一怼一',
    131 => '摞身',
    132 => '私人尺度',
    133 => '裸播软件',
    134 => '脱咣',
    135 => '粿身',
    136 => '伽徽',
    137 => '1v1',
    138 => '贞人漏',
    139 => '色聊',
    140 => '主播薇',
    141 => '招 主 播',
    142 => '威 信',
    143 => '玩热舞',
    144 => '全露小视频',
    145 => '死全家',
    146 => '夜映直播',
    147 => '不会封号',
    148 => '看美女拖光',
    149 => '业余时间',
    150 => '招主播',
    151 => '拁葳伈',
    152 => '侳愛',
    153 => '1对1',
    154 => '开车表演',
    //155 => '1⃣️怼1⃣️',
    156 => '全粿私博',
    157 => '加威号',
    158 => '百媚直播',
    159 => '裸体直播',
    160 => '螺奶',
    161 => '洗澡免费看',
    162 => '看表演',
    163 => '倮聊',
    164 => '麻烦看下私信哦',
    165 => '咖威信',
    );
    
    public function setOptions($options)
    {
        $this->_options = $options;
    }
    
    public function getOptions()
    {
        return $this->_options;
    }
    
    public static function getKeywords()
    {
        return self::$keywords;
    }
    
    public function setType($type)
    {
        $this->_type = $type;
    }
    
    public function getType()
    {
        return $this->_type;
    }
    
    public static function isDeny($content)
    {
        return preg_match("/[①②③④⑤⑥⑦⑧⑨⑩➀➁➂➃➄➅➆➇➈➉➊➋➌➍➎➏➐➑➒➓㊀㊁㊂㊃㊄㊅㊆㊇㊈㊉ⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌⓍⓎⓏⓐⓑⓒⓓⓔⓕⓖⓗⓘⓙⓚⓛⓜⓝⓞⓟⓠⓡⓢⓣⓤⓥⓦⓧⓨⓩ⒜⒝⒞⒟⒠⒡⒢⒣⒤⒥⒦⒧⒨⒩⒪⒫⒬⒭⒮⒯⒰⒱⒲⒳⒴⒵ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩⅪⅫⅰⅱⅲⅳⅴⅵⅶⅷⅸⅹⅺⅻⅼ①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮⑯⑰⑱⑲⑳⓪❶❷❸❹❺❻❼❽❾❿⓫⓬⓭⓮⓯⓰⓱⓲⓳⓴㊀㊁㊂㊃㊄㊅㊆㊇㊈㊉㈠㈡㈢㈣㈤㈥㈦㈧㈨㈩⑴⑵⑶⑷⑸⑹⑺⑻⑼⑽⑾⑿⒀⒁⒂⒃⒄⒅⒆⒇⒈⒉⒊⒋⒌⒍⒎⒏⒐⒑⒒⒓⒔⒕⒖⒗⒘⒙⒚⒛ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩⅪⅫⅰⅱⅲⅳⅴⅵⅶⅷⅸⅹⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌⓍⓎⓏⓐⓑⓒⓓⓔⓕⓖⓗⓘⓙⓚⓛⓜⓝⓞⓟⓠⓡⓢⓣⓤⓥⓦⓧⓨⓩ⒜⒝⒞⒟⒠⒡⒢⒣⒤⒥⒦⒧⒨⒩⒪⒫⒬⒭⒮⒯⒰⒱⒲⒳⒴⒵⁰⁴⁵⁶⁷⁸⁹₀₁₂₃₄₅₆₇₈₉①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮⑯⑰⑱⑲⑳㉑㉒㉓㉔㉕㉖㉗㉘㉙㉚㉛㉜㉝㉞㉟㊱㊲㊳㊴㊵㊶㊷㊸㊹㊺㊻㊼㊽㊾㊿⓪ⓞ⓵⓶⓷⓸⓹⓺⓻⓼⓽⓾⑴⑵⑶⑷⑸⑹⑺⑻⑼⑽⑾⑿⒀⒁⒂⒃⒄⒅⒆⒇➊➋➌➍➎➏➐➑➒➓⓫⓬⓭⓮⓯⓰⓱⓲⓳⓴º¹²³⁴⁵⁶⁷⁸⁹₀₁₂₃₄₅₆₇₈₉⒈⒉⒊⒋⒌⒍⒎⒏⒐⒑⒒⒓⒔⒕⒖⒗⒘⒙⒚⒛ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩⅰⅱⅲⅳⅴⅵⅶⅷⅸⅹ㊀㊁㊂㊃㊄㊅㊆㊇㊈㊉㈠㈡㈢㈣㈤㈥㈦㈧㈨㈩⓶ⓞ⓹⓶⓺⓵⓷㍙㍚㍛㍜㍝㍞㍟㍠]/u", $content) ? true : false;
    }
    
    public static function getNumbers($content)
    {
        $length = strlen($content);
        $numbers = "";
        for($i = 0; $i < $length; $i++) {
            if(is_numeric($content{$i})) {
                $numbers .= $content{$i};
            }
        }
        
        return $numbers;
    }
    
    public static function getCharacters($content)
    {
        $length = strlen($content);
        
        $characters = "";
        for($i = 0; $i < $length; $i++) {
            if(preg_match("/[a-z\d_]/iu", $content{$i})) {
                $characters .= $content{$i};
            }
        }
        
        return $characters;
    }
    
    static public function format($content)
    {
        //去除标点符号
        $filter = '´ ` ^ ~ < = > ¬ | ¦ _ ¯ - , ; : ! ¡ ? ¿ / . ¸ \' ‘ ’ " “ ” « » ( ) [ ] { } @ $ * \ & # % + ˊ ， . , ; \' / [ ]  - = ` ~ ! @ # $ % ^ & * ( ) _ + { } \ | : " < > ， 。 、 ！ ？ ～  ： ； >  ﹑ • ＂ … ｀ ＇ ‘ ’ “ ” 〝 〞 ∕ ¦ ‖ — ﹛ ﹜ 〈 〉 ﹝ ﹞ 「 」 ‹ › 〖 〗 《 》 〔 〕 『 』 « » 【 】 ﹐ ﹕ ﹔ ﹖ ﹏ ˊ ﹫ ＠ ︳ ＿ ¸ ︰ ; ¡ ¿ ﹌ ﹋ ´ ˋ ― ︴ ¯ － ￣ ﹢ ＋ ﹦ ﹤ ¬ ˜ ﹟ ﹩ ﹠ ﹪ ﹡ ﹨ ﹍ ﹎ ˆ ‐ ﹉ ﹊ ˇ ︵ ︷ ︿ ︹ ︽ _ ﹁ ﹃ ︻ ︶ ︸ ﹀ ︺ ︾ ˉ ﹂ ﹄ ︼ ～ 😍 ☞';
        $content = str_replace(explode(' ', $filter), "", $content);
        $content = preg_replace("/\s+/", "", $content);
        
        //符号标准化
        $search   = "零 一 二 三 四 五 六 七 八 九 壹 贰 叁 肆 伍 陆 柒 捌 玖 久 酒 ① ② ③ ④ ⑤ ⑥ ⑦ ⑧ ⑨ ０ １ ２ ３ ４ ５ ６ ７ ８ ９ ⒈ ⒉ ⒊ ⒋ ⒌ ⒍ ⒎ ⒏ ⒐ O l Ⓐ Ⓑ Ⓒ Ⓓ Ⓔ Ⓕ Ⓖ Ⓗ Ⓘ Ⓙ Ⓚ Ⓛ Ⓜ Ⓝ Ⓞ Ⓟ Ⓠ Ⓡ Ⓢ Ⓣ Ⓤ Ⓥ Ⓦ Ⓧ Ⓨ Ⓩ ⓐ ⓑ ⓒ ⓓ ⓔ ⓕ ⓖ ⓗ ⓘ ⓙ ⓚ ⓛ ⓜ ⓝ ⓞ ⓟ ⓠ ⓡ ⓢ ⓣ ⓤ ⓥ ⓦ ⓧ ⓨ ⓩ ₀ ₁ ₂ ₃ ₄ ₅ ₆ ₇ ₈ ₉ ⑳ ⑬ ⓹ ② ⑥ ❶ ❷ ❸ ❹ ❺ ❽ ⒪ ⑴ ⑵ ⑶ ⑹ ⑺ 🅰 1̶ 3̶ 5̶ 8̶ 2̶ ① ② ③ ④ ⑤ ⑥ ⑧ ⑨ ⑩ ⑪ ⑫ ⑬ ⑭ ⑮ ⑯ ⑰ ⑱ ⑲ ⑳ ⑴ ⑵ ⑶ ⑷ ⑸ ⑹ ⑺ ⑻ ⑼ ⑽ ⑾ ⑿ ⒀ ⒁ ⒂ ⒃ ⒄ ⒅ ⒆ ⒇ ⒈ ⒉ ⒊ ⒋ ⒌ ⒎ ⒏ ⒐ ⒑ ⒒ ⒓ ⒔ ⒕ ⒖ ⒗ ⒙ ⒚ ⒛ ❶ ❷ ❸ ❹ ❺ ❻ ❼ ❽ ❾ ❿ ㈠ ㈡ ㈢ ㈣ ㈤ ㈥ ㈦ ㈧ ㈨ ㈩ º ¹ ² ³ ₁ ₂ ₃̶";
        $replace  = "0 1 2 3 4 5 6 7 8 9 1 2 3 4 5 6 7 8 9 9 9 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 1 2 3 4 5 6 7 8 9 0 1 A B C D E F G H I J K L M N O P Q R S T U V W X Y Z a b c d e f g h i j k l m n o p q r s t u v w x y z 0 1 2 3 4 5 6 7 8 9 20 13 5 2 6 1 2 3 4 5 8 0 1 2 3 6 7 A 1 3 5 8 2 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 1 2 3 4 5 6 7 8 9 10 1 2 3 4 5 6 7 8 9 10 0 1 2 3 1 2 3";
        
        $search   = explode(' ', $search);
        $replace  = explode(' ', $replace);
        
        $content  = str_replace($search, $replace, $content);
        
        return $content;
    }
    
    public function getCache()
    {
        static $cache;
        
        if(!$cache) {
            $cache = Cache::getInstance("REDIS_CONF_CACHE");
        }
        
        return $cache;
    }
    
    public function getWords($content)
    {
        $sc = scws_open();
        scws_set_charset($sc, "utf8");
        scws_set_ignore($sc, true);
        scws_set_dict($sc, "", SCWS_XDICT_TXT);
        scws_set_rule($sc, ini_get('scws.default.fpath').'/rules_cht.utf8.ini');
        scws_send_text($sc, $content);
        
        $words = array();
        while($blocks = scws_get_result($sc)) {
            foreach ($blocks as $block) {
                if ($block['len'] == 1 && $block['word'] == "\r") {
                    continue;
                }
                if ($block['len'] == 1 && $block['word'] == "\n") {
                    $words[] = $block['word'];
                } else {
                    $words[] = sprintf("%s", $block['word']);
                }
            }
        }
        
        scws_close($sc);
        
        return $words;
    }
    
    static public function replace_emoji($str)
    {
        $tmpStr = json_encode($str); //暴露出unicode
        $tmpStr = preg_replace('/\\\ud([8-9a-f][0-9a-z]{2})/i', "", $tmpStr); //将emoji的unicode留下，其他不动
        $new_str = json_decode($tmpStr);
        return $new_str;
    }
}
?>